/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (+%2$d ponad)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Nie można rozpakować pliku \"%1$@\" z archiwum \"%2$@\": %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Nie można rozpakować rozwidlonych zasobów dla pliku \"%1$@\" z archiwum \"%2$@\":\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Kodowanie domyślne";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Wykryj automatycznie";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Rozpakuj";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Rozpakuj archiwum";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Rozpakowuję \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Przygotowuję do rozpakowania \"%@\"";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Wybierz";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Wybierz pliki do wypakowania";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Zawartość pliku \"%@\" nie może być rozpakowany przez ten program.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Wystąpił problem podczas rozpakowywania zawartości pliku \"%1$@\": %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Wystąpił problem podczas odczytywania zawartości pliku \"%1$@\": %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Wypakuj";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Musisz podać hasło aby otworzyć archiwum \"%@\".";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Gdzie Unarchiver ma rozpakować archiwa?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Czy chcesz, aby Unarchiver rozpakował archiwa do tego samego folderu co plik z archiwum, czy ma pytać o docelowy folder indywidualnie dla każdego archiwum?";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Pytaj za każdym razem";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Rozpakuj do tego samego folderu";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "Unarchiver nie ma prawa zapisu do tego folderu. Piaskownica w Mac OS X może blokować dostęp do niego. Wciśnij \"Rozpakuj\", żeby zapytać piaskownicę o zgodę na udzielenie prawa zapisu dla Unarchivera. Uprawnienia będą zapamiętane i Unarchiver nie będzie o nie pytał w przyszłości.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "Unarchiver musi wyszukać kolejne części tego archiwum, ale piaskownica Mac OS X blokuje dostępu do folderu. Aby umożliwić Unarchiverowi wyszukiwanie w tym folderze, kliknij \"Wyszukaj\". Uprawnienia będą zapamiętane i Unarchiver nie będzie o nie pytał w przyszłości.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Wyszukaj";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */

/* Common errors */
"Attempted to read more data than was available" = "Plik archiwum jest niekompletny";
"Opening file failed" = "Plik nie może zostać otwarty";
"Missing or wrong password" = "Podane hasło jest nieprawidłowe";
"Wrong checksum" = "Plik archiwum jest uszkodzony";
"Could not create directory" = "Nie można utworzyć folderu";

/* Uncommon or unused errors */
"Unknown error" = "Nieznany błąd";
"Failed to write to file" = "Zapis do pliku zakończony niepowodzeniem";
"Function called with illegal parameters" = "Funkcja wywołana z nieprawidłowymi parametrami";
"Not enough memory available" = "Za mało dostępnej pamięci";
"Data is corrupted" = "Dane uszkodzone";
"File is not fully supported" = "Plik nie jest w pełni obsługiwany";
"Required resource missing" = "Brak wymaganych zasobów";
"Error on decrunching" = "Błąd podczas decrunching";
"Unknown file type" = "Nierozpoznany typ pliku";
"File, disk has been skipped" = "Plik, dysk został pominięty";
"User cancelled extraction" = "Użytkownik przerwał rozpakowywanie";
"File already exists" = "Plik już istnieje";
"Verify failed (disk hook)" = "Niepowodzenie weryfikacji (disk hook)";
"Wrong drive geometry" = "Zła geometria dysku";
"Unknown data format" = "Nieznany format danych";
"Source contains no files" = "Źródło nie zawiera żadnych plików";
"Unknown filesystem" = "Nieznany system plików";
"Name of file exists as directory" = "Nazwa pliku istnieje jako katalog";
"Buffer was too short" = "Bufor był za mały";
"Text encoding was defective" = "Kodowanie tekstu było wadliwe";
"Could not create symlink" = "Nie można utworzyć dowiązania";



